#include <linux/version.h>
#include <linux/init.h>
#include <linux/module.h>
#include <linux/kernel.h>
#include <linux/fs.h>
#include <linux/proc_fs.h>
#include <linux/seq_file.h>
#include <linux/device.h>
#include <linux/platform_device.h>
#include <linux/of.h>
#include <linux/cdev.h>
#include <linux/slab.h>
#include <linux/semaphore.h>
#include <linux/ioport.h>
#include <linux/of_irq.h>
#include <linux/interrupt.h>
#include <linux/crypto.h>
#include <crypto/aead.h>
#include <crypto/aes.h>
#include <crypto/algapi.h>
#include <crypto/authenc.h>
#include <crypto/des.h>
#include <crypto/md5.h>
#include <crypto/sha.h>
#include <crypto/internal/skcipher.h>

#include <linux/jiffies.h>
#include <linux/math64.h>

#include <linux/sched.h>
#include <linux/slab.h>
#include <linux/timer.h>
#include <linux/delay.h>

#include <linux/dma-mapping.h>
#include <linux/dmapool.h>

#include <linux/mm.h>
#include <linux/pagemap.h>
#include <linux/rtnetlink.h>
#include <net/tcp.h>

#include "centic-crypto.h"

//#define DEBUG

#define SPEED_STATISTIC_ANALYSIS

//#define TEST_DMA

#define CENTIC_CRYPTO_ALG_PRIORITY	10000

#define CENTIC_CRYPTO_MAX_NUM_SG_DESC   128



#define CENTIC_CRYPTO_DMA_SG_DESC_CR_COMPLETED          0x80000000

#define CENTIC_CRYPTO_DMA_TEST_MAX_NUM_PAGES	128

#define CENTIC_CRYPTO_IPSEC_HASH_PG_SZ	64

#define CENTIC_CRYPTO_AEAD_FIFO_SIZE    512

# define _DPRINT(a...)

# define __DPRINT(a...)	do { printk("%s %u: ", __func__, __LINE__); printk (a); } while (0)

#ifdef DEBUG
# define DPRINT(a...)	do { printk("%s %u: ", __func__, __LINE__); printk (a); } while (0)
#else
# define DPRINT(a...)
#endif

#ifndef MIN
#define MIN(x,y) (((x) < (y)) ? x : y)
#endif

#if LINUX_VERSION_CODE < KERNEL_VERSION(3, 13, 0)
#ifndef list_last_entry
#define list_last_entry(ptr, type, member) \
        list_entry((ptr)->prev, type, member)
#endif
#endif

#define print_axi_sg_description_content(desc) \
        do { \
            printk("[0x%08X] bu_ad: 0x%08X - st: 0x%08X - nxt: 0x%08X - ctl: 0x%08X \n",desc->sg_desc_addr,\
            desc->hw.buf_addr,desc->hw.status,desc->hw.next_desc,desc->hw.control);\
        }\
        while(0)

struct centic_crypto_dma_request;
struct centic_crypto_engine;
struct centic_crypto_fops_context;


struct axi_dma_sg_desc{
    u32 next_desc;	/* 0x00 */
    u32 pad1;	/* 0x04 */
    u32 buf_addr;	/* 0x08 */
    u32 pad2;	/* 0x0C */
    u32 pad3;	/* 0x10 */
    u32 pad4;	/* 0x14 */
    u32 control;	/* 0x18 */
    volatile u32 status;	/* 0x1C */
    u32 app_0;	/* 0x20 */
    u32 app_1;	/* 0x24 */
    u32 app_2;	/* 0x28 */
    u32 app_3;	/* 0x2C */
    u32 app_4;	/* 0x30 */
};

#define AXI_DMA_SG_WRAPPER_BUSY         0x01

struct axi_dma_sg_desc_wrapper{
    struct axi_dma_sg_desc hw;
    struct list_head ring_entry;
    struct list_head req_entry;
    dma_addr_t sg_desc_dma_addr;
    volatile int flags;
}__aligned(64);


typedef void (*dma_request_complete_t)(struct centic_crypto_dma_request *);

#define CT_DMA_REQ_FLAGS_TO_DEVICE_DIRECTION    0x00000001
#define CT_DMA_REQ_FLAGS_SOF                    0x00000002

#define CT_DMA_REQ_FLAGS_STATE_MASK                   (7 << 2)
#define CT_DMA_REQ_FLAGS_STATE_PENDING                (0 << 2)
#define CT_DMA_REQ_FLAGS_STATE_PROCESSING             (1 << 2)
#define CT_DMA_REQ_FLAGS_STATE_COMPLETE               (2 << 2)

struct centic_crypto_dma_request {
    struct list_head entry;
    struct scatterlist *sg;
    int nents;
    int sgoff;
    volatile int flags;
    struct list_head sg_desc_list;
    struct centic_crypto_engine *engine;

    dma_request_complete_t complete;

